#ifndef PMERGEME_HPP_
#define PMERGEME_HPP_


#endif

// 以下の制約に従ってプログラムを作成してください：
// • プログラム名は PmergeMe とします。
// • プログラムは、正の整数列を引数として受け取れる必要があります。
// • プログラムは、マージインサートソートアルゴリズムを使用して、正の整数
// 列をソートする必要があります。
// 明確にしておくと、はい、フォード・ジョンソンのアルゴリズムを使用する必要があります。
// （出典：『Art Of Computer Programming』Vol.3. Merge Insertion,
// 184ページ）
// • プログラムの実行中にエラーが発生した場合は、標準エラー出力にエラーメッセージを表示する必要があります。
// この演習を検証するには、コード内で少なくとも2つの異なるコンテナを
// 使用する必要があります。プログラムは、重複する値を含めて、
// 少なくとも3000個の整数を処理できなければなりません。
// 各コンテナごとにアルゴリズムを実装し、汎用関数を使用することは避けることを強くお勧めします。
